# TextOrientation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
OrdinateDimensionSetting..::..TextOrientation Property
OrdinateDimensionSetting Class See Also
---
Specifies where to align the dimension text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public OrdinateTextOrientation TextOrientation { get; set; }
```

Visual Basic
---
```text
Public Property TextOrientation As OrdinateTextOrientation
	Get
	Set
```

Visual C++
---
```text
public:
property OrdinateTextOrientation TextOrientation {
	OrdinateTextOrientation get ();
	void set (OrdinateTextOrientation value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace